EDT_Connect/src/Catalogs/chains/chains.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>chains</name>
  <attributes>
    <name>brand</name>
    <type>
      <types>EnumRef.brandTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>currencySymbol</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>domainName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>loyaltyProgram</name>
    <type>
      <types>EnumRef.loyaltyTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>phoneMask</name>
    <type>
      <types>CatalogRef.CountryCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>timeZone</name>
    <type>
      <types>CatalogRef.timeZones</types>
    </type>
  </attributes>
  <attributes>
    <name>rulesRef</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>pdnRef</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EdnaPlatformUsed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>translation</name>
    <attributes>
      <name>language</name>
      <type>
        <types>CatalogRef.languages</types>
      </type>
    </attributes>
    <attributes>
      <name>description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>cacheTypes</name>
    <attributes>
      <name>cacheType</name>
      <type>
        <types>CatalogRef.cacheTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>isUsed</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>isUpdated</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT_Connect/src/Catalogs/users/users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>users</name>
  <owners>Catalog.accounts</owners>
  <attributes>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>birthday</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>canUpdatePersonalData</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>firstName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>gender</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>lastName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>notSubscriptionEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>notSubscriptionSms</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>photo</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>secondName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>userCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>userType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT_Connect/src/CommonModules/Token/Module.bsl
Function get(token, parameters) Export
	currentDate = ToUniversalTime(CurrentDate());
	If token.IsEmpty() Then
		tokenObject = Catalogs.tokens.CreateItem();
		tokenObject.createDate = currentDate;
	Else
		tokenObject = token.GetObject();
	EndIf;
	tokenObject.appType = parameters.appType;
	tokenObject.appVersion = parameters.appVersion;
	tokenObject.chain = parameters.chain;
	tokenObject.changeDate = currentDate;
	tokenObject.deviceModel = parameters.deviceModel;
	tokenObject.deviceToken = parameters.deviceToken;
	tokenObject.holding = parameters.holding;
	tokenObject.systemType = parameters.systemType;
	tokenObject.systemVersion = ?(parameters.Property("systemVersion"),parameters.systemVersion,"");
	tokenObject.timeZone = parameters.timeZone;
	tokenObject.Write();
	Return tokenObject.Ref;
EndFunction	

Function initContext() Export
	tokenContext		= New Structure();
	tokenContext.Insert("token", Catalogs.tokens.EmptyRef());
	tokenContext.Insert("appType", Enums.appTypes.EmptyRef());
	tokenContext.Insert("appVersion", 0);
	tokenContext.Insert("chain", Catalogs.chains.EmptyRef());
	tokenContext.Insert("changeDate", Date(1,1,1));
	tokenContext.Insert("createDate", Date(1,1,1));
	tokenContext.Insert("deviceModel", "");
	tokenContext.Insert("deviceToken", "");
	tokenContext.Insert("holding", Catalogs.holdings.EmptyRef());
	tokenContext.Insert("lockDate", Date(1,1,1));
	tokenContext.Insert("systemType", Enums.systemTypes.EmptyRef());
	tokenContext.Insert("systemVersion", "");
	tokenContext.Insert("timezone", Catalogs.timeZones.EmptyRef());
	tokenContext.Insert("underControl", False);	
	tokenContext.Insert("user", Catalogs.users.EmptyRef());
	tokenContext.Insert("account", Catalogs.accounts.EmptyRef());
	tokenContext.Insert("userType", "");
	Return tokenContext;	
EndFunction

Procedure block(token) Export
	tokenObject = token.GetObject();
	tokenObject.lockDate = ToUniversalTime(CurrentDate());
	tokenObject.Write();	
	If not token.user.IsEmpty() Then
		ExchangePlans.RecordChanges(GeneralReuse.nodeUsersCheckIn(Enums.registrationTypes.checkIn), token.user);
	EndIf;
EndProcedure

Procedure editProperty(val token, struct) Export
	tokenObject = token.GetObject();
	If tokenObject <> Undefined Then
		If (ValueIsFilled(tokenObject.account) and tokenObject.account<>catalogs.accounts.Tilda) or (NOT ValueIsFilled(tokenObject.account)) then		
			For Each element In struct Do
				If element.key = "user" Then
					ExchangePlans.RecordChanges(GeneralReuse.nodeUsersCheckIn(Enums.registrationTypes.checkIn), ?(ValueIsFilled(element.value), element.value, tokenObject.user));
				EndIf;
				tokenObject[element.key] = element.value;
			EndDo;
			tokenObject.changeDate = ToUniversalTime(CurrentDate());
			try
				tokenObject.Write();
			Except
			EndTry;	
		EndIf;
	EndIf;
EndProcedure
